; Wise Memory Optimizer
; TranslationAuthor: original; penaV
; TranslationAuthorEmail: penav@outlook.com
; Soft Version: 3.52.100
; Lang. Update: 2018-Mar-05

[Lang]
NativeLanguage=Finnish-Suomi

[GUI]
ButtonYes=Kyllä
ButtonNo=Ei
ButtonOK=OK
ButtonClose=Sulje

[Translation]
LangCode=040B
ReadHabit=Left-to-right
LanguageName=FIN
LangShortName=fi-fi
DefaultFont=Tahoma
DefaultFontSize=8
DefaultCharset=ANSI_CHARSET
Information=Tietoja Päivityksestä
Warning=Varoitukset
Error=Virhe
Confirm=Vahvista
;
; Memory Optimization - Muistin Tehostus
;
FrmMoMain.imgmail.hint=Jaa Wise Memory Optimizeria ystävillesi
FrmMoMain.imgfacebook.hint=Tykkää WiseCleaneristä Facebookissa
FrmMoMain.imgtwitter.hint=Jaa Wise Memory Optimizeria Twitterissä
FrmMoMain.chkupdate.caption=Auto tarkista uusin versio.
FrmMoMain.btnlike.caption=Tykkää
FrmMoMain.lblTotalMem.Caption=Muisti Koko:
FrmMoMain.lblaopt.Caption=Auto Tehosta mikäli muistia on alle:  
FrmMoMain.lbltry.Caption=Vapauta lisää muistia
FrmMoMain.btnsettings.Caption=Asetukset
FrmMoMain.btnOpt.Caption=Tehosta Nyt
FrmMoMain.chkmin.Caption=Pienennä ilmaisin alueelle
FrmMoMain.chkauto.Caption=Suorita kun Windows käynnistyy
FrmMoMain.chkautoOpt.Caption=Salli Auto Tehostus
FrmMoMain.ckchkclearborad.Caption=Tyhjennä Leikepöytä tehostuksen aikana
FrmMoMain.chkidle.Caption=Suorita kun Prosessori on jouten. (Suositus)
FrmMoMain.lbllang.Caption=Oletus Kieli:
;
; About - Tietoja
;
FrmAbout.caption=Tietoja Ohjelmasta ja Meistä
FrmAbout.btnok.caption=OK
FrmAbout.lblver.caption=Nykyinen Versio:
FrmAbout.lblemail.caption=Tuen Sähköposti:
FrmAbout.lblhome.caption=Kotisivu:
FrmAbout.lblthanks.caption=Kiitos seuraaville henkilöille heidän avusta:

[MemoryOptimizer]
ThisTimeFreeMemory=Muistia vapautui %s tällä kerralla.
CurPrecent=Nykyinen Muistin Käytön määrä:
UsedMemory=Muistia Käytössä:
AvailableMemory=Muistia Saatavilla:
FreeMemory=Muistia Vapautui:
At=Kello 
pmShow=Näytä Pääohjelma Ikkuna
pmOpt=Tehosta Nyt
pmAbout=Tietoja Meistä
pmExit=Poistu
SureExit=Tehostetaan Muistin käyttöä, oletko varma että halauat poistua nyt?
Mintotray=Tehostetaan Muistin käyttöä

[Message]
NewVer=Uusi versio saatavilla! Haluatko päivittää siihen nyt?
NotShowNotice=Älä näytä tätä huomautusta uudelleen.